app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 8]]
---
    <div class="border p-2">
      <% post.comments.each do |comment| %>