app/views/posts/show.html.erb

  <div class="border p-2">
    <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]