app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 7], ["post_id", 9], ["created_at", "2022-04-01 14:26:06.616439"], ["updated_at", "2022-04-01 14:26:06.616439"]]
---
  def create
    @post = Post.find(params[:post_id])
    @like = @post.likes.new(author_id: current_user.id, post_id: @post.id)

    respond_to do |format|
      format.html do
        if @like.save