app/controllers/posts_controller.rb

  def index
    @posts = Post.where(author_id: params[:user_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["author_id", 1], ["id", 3], ["LIMIT", 1]]